# Taps
tap "homebrew/services"
tap "mobile-dev-inc/tap"

# Core tools
brew "age"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fzf"
brew "gh"
brew "git-gui"
brew "gnupg"
brew "wget"
brew "zoxide"

# Languages & runtimes
brew "go"
brew "node@22"
brew "nvm"
brew "pyenv"
brew "pipx"
brew "rbenv"
brew "rust"
brew "uv"

# Mobile development
brew "cocoapods"
brew "ios-deploy"
brew "watchman"
brew "mobile-dev-inc/tap/maestro"
cask "android-platform-tools"
cask "flutter"
cask "temurin@17"
cask "temurin@20"

# Web & cloud
brew "awscli"
brew "docker"
brew "pnpm"
brew "vercel-cli"
brew "yarn"
cask "gcloud-cli"

# Media & images
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"

# Databases
brew "libpq"
brew "postgresql@15", restart_service: :changed

# PDF & document tools
brew "poppler"
brew "qpdf"

# IoT & hardware
brew "arduino-cli"
brew "cmake"
brew "esphome"
brew "esptool"
brew "platformio"

# Misc tools
brew "duti"
brew "livekit-cli"
brew "repomix"
brew "sshpass"
brew "tailscale"

# Fonts
cask "font-meslo-lg-nerd-font"

# Casks
cask "chromium"
cask "dotnet-sdk"
cask "openscad"
cask "prusaslicer"
cask "removebg"

# Cursor extensions
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "fwcd.kotlin"
vscode "mateocerquetella.xcode-12-theme"
vscode "mathiasfrohlich.kotlin"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.java"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"

# Cargo
cargo "mdbook"
